/*  "adc_test12.c"  ---- Test Hall A 18-bit ADC ---- */

/*  E.J.  8/14/2006  -  add option to write raw data to file */ 
/*        10/9/2006  -  prompt to specify # samples */ 

#include <stdioLib.h>
#include <usrLib.h>
#include <stdlib.h>
#include <taskLib.h>
#include <math.h>
#include <stddef.h>

#define ADC_REG  0x0ED000	/* base address of 18-bit ADC register space */
#define ADC_DATA 0x0ED100	/* base address of 18-bit ADC data space */	

#define TIME_MOD 0xB0B0		/* base address of timer module */

#define DATA_FILENAME "/adaqfs/halla/adev/hapc6/test_data_file.dat"	

#define PRINT_EVENT   1		/* print data/stats from each event */	
#define PRINT_RAW     1		/* print raw samples from each event (if PRINT_EVENT = 1) */	
#define PRINT_DAC     1		/* print DAC value for each event (if PRINT_EVENT = 1) */	
#define PRINT_STUDIES 1		/* print additional studies */	

#define NTRIG   1000		/* number of triggers to generate in a set */	

#define TIME_INT 11.0		/* sample time (us) for internal timing sequence */	
#define TIME_EXT 9.0		/* sample time (us) for external timing sequence */
	

struct time_struc {
  short ext_in;		/* 00 */
  short blank_1;		/* 02 */
  short blank_2;		/* 04 */
  short dac_12;		/* 06 */
  short dac_16;		/* 08 */
  short ramp;		/* 0C */
  short integrate;	/* 0E */
  short oversample;	/* 10 */
};
		 

struct adc_struc {
  long mod_id;		/* 00 */
  long csr;		/* 04 */
  long ctrl;		/* 08 */
  long cfg_adc;		/* 0C */
  long evt_ct;		/* 10 */
  long evt_word_ct;	/* 14 */
  long dac_value;	/* 18 */
  long reserved_1;	/* 1C */
  long dac_memory;	/* 20 */
  long spare[3];		/* 24,28,2C */
  long delay_1;		/* 30 */
  long delay_2;		/* 34 */
};
		 
void decode_data(unsigned long data);
void reg_decode(void);
void reg_status(void);
int readout(void);
int trig_gen(void);
void init_raw(void);
void event_stats_raw(void);
void event_stats(unsigned long ch, unsigned long base_peak, unsigned long x);
void init_event_stats(void);
void print_event_stats(void);
void init_stats(void);
void stats(long n_stat, unsigned long ch, float y);
void print_stats(long n_stat);
void hist_init(long mode);
void bin(long n_hist, float y);
void hist_print(long n_hist);
void print_studies(void);
void write_data_raw(FILE *fd, long n_trig, long n_samples);
long write_setup(FILE *fd);

unsigned long print_event;

unsigned long raw_data[4][2][8];	/* [i][j][k] = [ch_n][base/peak][sample_n] */
unsigned long raw_n[4][2];		/* [i][j] = [ch_n][base/peak] */
unsigned long raw_sum[4][2];		/* [i][j] = [ch_n][base/peak] */
		
volatile unsigned long xnum[4][2];	/* for event stats */
volatile double xavg[4][2];
volatile double x2avg[4][2];
